emacs.org
#+TITLE:     My Emacs Notes
#+AUTHOR:    Richard Y. Kim
#+EMAIL:     emacs18@gmail.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil |:t ^:nil -:t f:t *:t d:nil tags:not-in-toc
#+SETUPFILE: theme-bigblow.setup

* Overview
** Introduction

This is my collection of GNU/Emacs related notes which I wrote for my
own use as well as to share with my friends and colleagues.
This may be a bit chaotic, because much of it was lifted from a much larger
document which I have been carrying around for many years.

*Warning*: many links are not properly rendered by github.
Please see [[file:README.org][README.org]] on how best to read this document.

This document is written in [[info:org#Top][org-mode]]. It is best viewed using emacs in org
format, but you can also view the HTML version via a web browser.

Why another document on emacs when there are so many online resources already?
Although there are many online resources, almost none of them cross link to the
official manuals which I think is quite unfortunate, because in my opinion one
of the best things about emacs is its excellent documentation which can be
accessed from within emacs in many ways.

The [[http://www.gnu.org/software/emacs/tour/][Official Guided Tour]] is just about the only online resource that I could
find that has more than a few links to the official manuals. Unfortunately this
document does not seem to refer to any unofficial resources outside of [[http://gnu.org][gnu.org]],
e.g., there is no mention of packages such as [[https://github.com/magit/magit][magit]], [[https://gitorious.org/evil/evil.git][evil]], and many many other
excellent packages some of which are mentioned in this document. My goals with
this document is to help my friends and colleagues not only learn many
features of emacs, but also to get them well versed in emacs documentation
system so that they can learn all that emacs has to offer on their own.

This document cross links heavily with the official manuals
such as the [[info:emacs#Top][Emacs Manual]] and the [[info:elisp#Top][Emacs-Lisp Manual]].
If you are reading this document within emacs as org files, then clicking on
these links bring up GNU [[info:info][info]] browser.  If you are reading the html version
(e.g., https://github.com/emacs18/notes), then most emacs related links
will take you to documents located under
http://www.gnu.org/software/emacs/manual/html_mono.

** How to learn or lookup features
:PROPERTIES:
:CUSTOM_ID: learning
:END:
#+INDEX: learning

The chapter of emacs manual details many ways to get help.
Also [[info:info#Top][info manual]] is a good way to learn the GNU info browser.
A few of the topics discussed in these manuals are listed below.

- Hitting =C-h= or =?= following any incomplete key sequence will list all
  possible key bindings, e.g., try typing =C-x 4 C-h=.
  Also [[https://github.com/justbur/emacs-which-key][which-key]] add-on package shows all possible key bindings as you type.
- Type =C-h C-h= to see what commands follow =C-h= and learn as many of these
  as possible.
- helm is another great way.  Just type =M-x= and start typing space separate
  regexp of the command that you want to locate, e.g., typing "back color"
  shows that =set-background-color= is the only match.

Some of the commands that start with =C-h= are:
|-------+--------------------+-------------------------------------------|
| Key   | Function           | Comment                                   |
|-------+--------------------+-------------------------------------------|
| [[info:info#Top][C-h i]] | info               | launch GNU/info browser                   |
| [[info:emacs#Key Help][C-h k]] | describe-key       | describe specified key sequence           |
| [[info:emacs#Name Help][C-h f]] | describe-function  | describe specified function               |
| [[info:emacs#Name Help][C-h v]] | describe-variable  | describe specified variable               |
| [[info:emacs#Misc Help][C-h S]] | info-lookup-symbol | locate manual section on specified symbol |
| [[info:emacs#Major Modes][C-h m]] | describe-mode      | summary of current major mode             |
| [[info:emacs#Apropos][C-h a]] | apropos-command    | find symbols by name                      |
|-------+--------------------+-------------------------------------------|

** Document Format

This document is authored in [[http://orgmode.org][org-mode]] format within GNU/Emacs, then converted to
HTML via emacs. I prefer to use the /bigblow/ HTML theme provided by
[[https://github.com/fniessen/org-html-themes][org-html-themes]] add-on package.

I started writing this document in [[http://www.gnu.org/software/texinfo/][texinfo]] format, but then switched over to
using [[info:org][org-mode]].

Although most folks probably read HTML version of this document, I read and
edit this document in org format.  One key advantage of org mode is that
links to Emacs and Elisp manuals pop up instantaneously without any delay.

Most links to the [[info:info][info]] documents are presented using info node name notation,
e.g., [[info:emacs#Help][(emacs)Help]].   See [[GNU info documentation system]] below for more info.

** GNU info documentation system

If you hit =C-h i= or =M-x info= within emacs, it brings up the [[info:info][info]] document
browser which allows you to browse many info documents. Hitting [[info:info#Help-Int][d]] within the
info browser displays all the info files that are currently known to emacs.
From there you can browse /emacs/, /elisp/, or any other document currently
available.

