emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-24 Sun 08:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Notes</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="Richard Y. Kim" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">My Emacs Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6cb6071">Overview</a>
<ul>
<li><a href="#orgd508a24">Introduction</a></li>
<li><a href="#learning">How to learn or lookup features</a></li>
<li><a href="#orgc5e666a">Document Format</a></li>
<li><a href="#org80c44b6">GNU info documentation system</a></li>
</ul>
</li>
<li><a href="#resources">Resources</a>
<ul>
<li><a href="#orge1e3769">General Resources</a></li>
<li><a href="#org1448624">New User Resources</a></li>
<li><a href="#orgc8e3535">Emacs News/RSS/Blog Sites</a></li>
<li><a href="#org338a6d4">Startup Files</a></li>
<li><a href="#org1c02baf">Org Mode</a></li>
</ul>
</li>
<li><a href="#package">Package</a>
<ul>
<li><a href="#orge58b3">Package Overview</a></li>
</ul>
</li>
<li><a href="#orgd103a2a">Emacs-Lisp</a>
<ul>
<li><a href="#elisp_basics">Elisp Basics</a></li>
<li><a href="#expressions">Elisp Expressions</a></li>
<li><a href="#symbols">Symbols</a></li>
<li><a href="#advising">Advising</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6cb6071" class="outline-2">
<h2 id="org6cb6071">Overview</h2>
<div class="outline-text-2" id="text-org6cb6071">
</div><div id="outline-container-orgd508a24" class="outline-3">
<h3 id="orgd508a24">Introduction</h3>
<div class="outline-text-3" id="text-orgd508a24">
<p>
This is my collection of GNU/Emacs related notes which I wrote for my
own use as well as to share with my friends and colleagues.
This may be a bit chaotic, because much of it was lifted from a much larger
document which I have been carrying around for many years.
</p>

<p>
<b>Warning</b>: many links are not properly rendered by github.
Please see <a href="README.html">README.org</a> on how best to read this document.
</p>

<p>
This document is written in <a href="http://www.gnu.org/software/emacs/manual/html_mono/org.html#Top">org-mode</a>. It is best viewed using emacs in org
format, but you can also view the HTML version via a web browser.
</p>

<p>
Why another document on emacs when there are so many online resources already?
Although there are many online resources, almost none of them cross link to the
official manuals which I think is quite unfortunate, because in my opinion one
of the best things about emacs is its excellent documentation which can be
accessed from within emacs in many ways.
</p>

<p>
The <a href="http://www.gnu.org/software/emacs/tour/">Official Guided Tour</a> is just about the only online resource that I could
find that has more than a few links to the official manuals. Unfortunately this
document does not seem to refer to any unofficial resources outside of <a href="http://gnu.org">gnu.org</a>,
e.g., there is no mention of packages such as <a href="https://github.com/magit/magit">magit</a>, <a href="https://gitorious.org/evil/evil.git">evil</a>, and many many other
excellent packages some of which are mentioned in this document. My goals with
this document is to help my friends and colleagues not only learn many
features of emacs, but also to get them well versed in emacs documentation
system so that they can learn all that emacs has to offer on their own.
</p>

<p>
This document cross links heavily with the official manuals
such as the <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Top">Emacs Manual</a> and the <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Top">Emacs-Lisp Manual</a>.
If you are reading this document within emacs as org files, then clicking on
these links bring up GNU <a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Top">info</a> browser.  If you are reading the html version
(e.g., <a href="https://github.com/emacs18/notes">https://github.com/emacs18/notes</a>), then most emacs related links
will take you to documents located under
<a href="http://www.gnu.org/software/emacs/manual/html_mono">http://www.gnu.org/software/emacs/manual/html_mono</a>.
</p>
</div>
</div>

<div id="outline-container-org308d8f1" class="outline-3">
<h3 id="learning"><a id="org308d8f1"></a>How to learn or lookup features</h3>
<div class="outline-text-3" id="text-learning">
<p>
The chapter of emacs manual details many ways to get help.
Also <a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Top">info manual</a> is a good way to learn the GNU info browser.
A few of the topics discussed in these manuals are listed below.
</p>

<ul class="org-ul">
<li>Hitting <code>C-h</code> or <code>?</code> following any incomplete key sequence will list all
possible key bindings, e.g., try typing <code>C-x 4 C-h</code>.
Also <a href="https://github.com/justbur/emacs-which-key">which-key</a> add-on package shows all possible key bindings as you type.</li>
<li>Type <code>C-h C-h</code> to see what commands follow <code>C-h</code> and learn as many of these
as possible.</li>
<li>helm is another great way.  Just type <code>M-x</code> and start typing space separate
regexp of the command that you want to locate, e.g., typing "back color"
shows that <code>set-background-color</code> is the only match.</li>
</ul>

<p>
Some of the commands that start with <code>C-h</code> are:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Top">C-h i</a></td>
<td class="org-left">info</td>
<td class="org-left">launch GNU/info browser</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Key-Help">C-h k</a></td>
<td class="org-left">describe-key</td>
<td class="org-left">describe specified key sequence</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Name-Help">C-h f</a></td>
<td class="org-left">describe-function</td>
<td class="org-left">describe specified function</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Name-Help">C-h v</a></td>
<td class="org-left">describe-variable</td>
<td class="org-left">describe specified variable</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Misc-Help">C-h S</a></td>
<td class="org-left">info-lookup-symbol</td>
<td class="org-left">locate manual section on specified symbol</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Major-Modes">C-h m</a></td>
<td class="org-left">describe-mode</td>
<td class="org-left">summary of current major mode</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Apropos">C-h a</a></td>
<td class="org-left">apropos-command</td>
<td class="org-left">find symbols by name</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc5e666a" class="outline-3">
<h3 id="orgc5e666a">Document Format</h3>
<div class="outline-text-3" id="text-orgc5e666a">
<p>
This document is authored in <a href="http://orgmode.org">org-mode</a> format within GNU/Emacs, then converted to
HTML via emacs. I prefer to use the <i>bigblow</i> HTML theme provided by
<a href="https://github.com/fniessen/org-html-themes">org-html-themes</a> add-on package.
</p>

<p>
I started writing this document in <a href="http://www.gnu.org/software/texinfo/">texinfo</a> format, but then switched over to
using <a href="http://www.gnu.org/software/emacs/manual/html_mono/org.html#Top">org-mode</a>.
</p>

<p>
Although most folks probably read HTML version of this document, I read and
edit this document in org format.  One key advantage of org mode is that
links to Emacs and Elisp manuals pop up instantaneously without any delay.
</p>

<p>
Most links to the <a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Top">info</a> documents are presented using info node name notation,
e.g., <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Help">(emacs)Help</a>.   See <a href="#org80c44b6">GNU info documentation system</a> below for more info.
</p>
</div>
</div>

<div id="outline-container-org80c44b6" class="outline-3">
<h3 id="org80c44b6">GNU info documentation system</h3>
<div class="outline-text-3" id="text-org80c44b6">
<p>
If you hit <code>C-h i</code> or <code>M-x info</code> within emacs, it brings up the <a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Top">info</a> document
browser which allows you to browse many info documents. Hitting <a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Help-Int">d</a> within the
info browser displays all the info files that are currently known to emacs.
From there you can browse <i>emacs</i>, <i>elisp</i>, or any other document currently
available.
</p>
</div>
</div>
</div>
