emacs.org
* Resources
  :PROPERTIES:
  :CUSTOM_ID: resources
  :END:
#+INDEX: resources

This chapter lists some of the online emacs resources available that I
came across over the years.

** General Resources

There are just too many resources, but here is my collection of few links.

- [[http://www.gnu.org/software/emacs/][Emacs Official Home Page]] has more modern look and feel as of early 2016.
- [[http://emacswiki.org][Emacs Wiki]] is not "official", but it is
  perhaps the best resource in terms of variety of topics covered.
- [[http://en.wikipedia.org/wiki/Emacs][wikipedia article]] provides good history of emacs.
- [[http://www.masteringemacs.org][masteringemacs]] covers a book with the same name, but it also has
  links to some useful articles as well.
  [[http://www.masteringemacs.org/reading-guide][Reading Guide]] link at the top seems
  especially useful.
- [[http://directory.fsf.org/wiki/Emacs][Official Wiki]] does not seem to be that useful.
- [[https://plus.google.com/communities/114815898697665598016][Google+ community]] with over 9000 members as of May 2015.
- [[http://emacs.stackexchange.com/][Emacs at stackexchange]]
- [[http://tuhdo.github.io/][Tu Do's excellent documents]] have lots of GIF animations.
- [[http://www.finseth.com/emacs.html][Emacs Implementations and Literature]] has encyclopedic collection of different
  implementations of emacs or emacs-like programs, emacs related books, and
  other online resources.
- [[http://declank.com/building-and-debugging-gnu-emacs-part-1/][Building and Debugging GNU Emacs: Part 1]] by Declan Kelly seems to have good
  info on how to build emacs on linux as well as debug.
- [[http://www.reddit.com/r/emacs/comments/3ge5ad/scifi_author_tony_ballantyne_on_emacs/][SciFi author Tony Ballantyne on emacs]]
  covers how a writer uses emacs to write articles and books

** New User Resources

- [[info:emacs-lisp-intro][An Introduction to Programming in Emacs Lisp]]
- [[http://www.gnu.org/software/emacs/tour/][Official Guided Tour]]
  gives good overview of emacs features with links to emacs manuals.
  One drawback is that this does not refer to resources that are not
  "official", e.g., it mentions viper, but not [[https://gitorious.org/evil/evil.git][evil]].
- [[http://www.emacswiki.org/emacs/EmacsNewbie][EmacsNewbie at emacswiki]] lists other resources for new users.
- [[http://www.star.bris.ac.uk/bjm/emacs-tips.html][Emacs Tips]] is someone's attempt at providing emacs tips to colleagues.
  It would be nice if I could join forces with folks like this so that we can
  create an org document with cross links to the manuals.
- [[http://emacslife.com/how-to-read-emacs-lisp.html][Read Lisp, Tweak Emacs: How to read Emacs Lisp so that you can customize Emacs]]

** Emacs News/RSS/Blog Sites

There are many blog and other site.
These are just a few that I came across.

- [[http://endlessparentheses.com/][Endless Parentheses]] is a blog which often has good articles
- [[http://www.lunaryorn.com/][lunarsite]] is another blog site
- [[https://emacs.zeef.com/ehartc][Ernst de Hart]] - collection of packages categorized by topic
- [[http://planet.emacsen.org/][Planet Emacsen]] - RSS Feed
- [[http://emacsredux.com/][Emacs Redux]] (last updated on [2015-01-15])
- [[http://emacs-fu.blogspot.com/][emacs-fu]] (last updated on [2013-03-17])
- [[http://batsov.com/articles/2011/11/30/the-ultimate-collection-of-emacs-resources/][Batsov's Collection of Resources]] (last updated on [2011-11-30])

** Startup Files

These links discuss emacs startup files.
There are many others I'm sure.

- [[http://doc.norang.ca/org-mode.html][Bernt Hansen]] - "Org Mode - Organize Your Life In Plain Text!" is an excellent
  resource on org-mode as well as many things emacs related.
- [[http://oremacs.com/2015/04/24/oremacs-config/][Oleh Krehel]]
- [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua]]
- [[https://github.com/grettke/home][grettke]] (see ALEC.org)
- [[https://github.com/larstvei/dot-emacs][Lars Tveito]]
- Ryan Rix: [[http://fort.kickass.systems:10082/cgit/fsem.git/tree/][org source]], [[http://doc.rix.si/org/fsem.html][html version]], [[http://rix.si/blog/2015/01/05/fsem-001/][2015/01/05 blog]]

** Org Mode

Some links on org mode:

- [[http://orgmode.org][org-mode home page]]
- [[http://orgmode.org/worg][worg]]
- [[http://www.emacswiki.org/emacs/OrgMode][OrgMode at emacswiki]]
- [[http://orgmode.org/worg/dev/][worg dev]]
- [[http://doc.norang.ca/org-mode.html][Bernt Hansen]] - "Org Mode - Organize Your Life In Plain Text!"
- [[http://orgmode.org/worg/org-tutorials/][Tutorials at worg]]
- [[https://www.youtube.com/watch?v%3D1-dUkyn_fZA&feature%3Dyoutube_gdata_player][Emacs + org-mode + python in reproducible research; SciPy 2013 Presentation]]
- [[http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html][Emacs org-mode examples and cookbook]] - lots of neat ways to use org

* Package
  :PROPERTIES:
  :CUSTOM_ID: package
  :END:
#+INDEX: package

