emacs.html

<div id="outline-container-org9f790eb" class="outline-2">
<h2 id="resources"><a id="org9f790eb"></a>Resources</h2>
<div class="outline-text-2" id="text-resources">
<p>
This chapter lists some of the online emacs resources available that I
came across over the years.
</p>
</div>

<div id="outline-container-orge1e3769" class="outline-3">
<h3 id="orge1e3769">General Resources</h3>
<div class="outline-text-3" id="text-orge1e3769">
<p>
There are just too many resources, but here is my collection of few links.
</p>

<ul class="org-ul">
<li><a href="http://www.gnu.org/software/emacs/">Emacs Official Home Page</a> has more modern look and feel as of early 2016.</li>
<li><a href="http://emacswiki.org">Emacs Wiki</a> is not "official", but it is
perhaps the best resource in terms of variety of topics covered.</li>
<li><a href="http://en.wikipedia.org/wiki/Emacs">wikipedia article</a> provides good history of emacs.</li>
<li><a href="http://www.masteringemacs.org">masteringemacs</a> covers a book with the same name, but it also has
links to some useful articles as well.
<a href="http://www.masteringemacs.org/reading-guide">Reading Guide</a> link at the top seems
especially useful.</li>
<li><a href="http://directory.fsf.org/wiki/Emacs">Official Wiki</a> does not seem to be that useful.</li>
<li><a href="https://plus.google.com/communities/114815898697665598016">Google+ community</a> with over 9000 members as of May 2015.</li>
<li><a href="http://emacs.stackexchange.com/">Emacs at stackexchange</a></li>
<li><a href="http://tuhdo.github.io/">Tu Do's excellent documents</a> have lots of GIF animations.</li>
<li><a href="http://www.finseth.com/emacs.html">Emacs Implementations and Literature</a> has encyclopedic collection of different
implementations of emacs or emacs-like programs, emacs related books, and
other online resources.</li>
<li><a href="http://declank.com/building-and-debugging-gnu-emacs-part-1/">Building and Debugging GNU Emacs: Part 1</a> by Declan Kelly seems to have good
info on how to build emacs on linux as well as debug.</li>
<li><a href="http://www.reddit.com/r/emacs/comments/3ge5ad/scifi_author_tony_ballantyne_on_emacs/">SciFi author Tony Ballantyne on emacs</a>
covers how a writer uses emacs to write articles and books</li>
</ul>
</div>
</div>

<div id="outline-container-org1448624" class="outline-3">
<h3 id="org1448624">New User Resources</h3>
<div class="outline-text-3" id="text-org1448624">
<ul class="org-ul">
<li><a href="emacs-lisp-intro.html#Top">An Introduction to Programming in Emacs Lisp</a></li>
<li><a href="http://www.gnu.org/software/emacs/tour/">Official Guided Tour</a>
gives good overview of emacs features with links to emacs manuals.
One drawback is that this does not refer to resources that are not
"official", e.g., it mentions viper, but not <a href="https://gitorious.org/evil/evil.git">evil</a>.</li>
<li><a href="http://www.emacswiki.org/emacs/EmacsNewbie">EmacsNewbie at emacswiki</a> lists other resources for new users.</li>
<li><a href="http://www.star.bris.ac.uk/bjm/emacs-tips.html">Emacs Tips</a> is someone's attempt at providing emacs tips to colleagues.
It would be nice if I could join forces with folks like this so that we can
create an org document with cross links to the manuals.</li>
<li><a href="http://emacslife.com/how-to-read-emacs-lisp.html">Read Lisp, Tweak Emacs: How to read Emacs Lisp so that you can customize Emacs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc8e3535" class="outline-3">
<h3 id="orgc8e3535">Emacs News/RSS/Blog Sites</h3>
<div class="outline-text-3" id="text-orgc8e3535">
<p>
There are many blog and other site.
These are just a few that I came across.
</p>

<ul class="org-ul">
<li><a href="http://endlessparentheses.com/">Endless Parentheses</a> is a blog which often has good articles</li>
<li><a href="http://www.lunaryorn.com/">lunarsite</a> is another blog site</li>
<li><a href="https://emacs.zeef.com/ehartc">Ernst de Hart</a> - collection of packages categorized by topic</li>
<li><a href="http://planet.emacsen.org/">Planet Emacsen</a> - RSS Feed</li>
<li><a href="http://emacsredux.com/">Emacs Redux</a> (last updated on <span class="timestamp-wrapper"><span class="timestamp">[2015-01-15 Thu]</span></span>)</li>
<li><a href="http://emacs-fu.blogspot.com/">emacs-fu</a> (last updated on <span class="timestamp-wrapper"><span class="timestamp">[2013-03-17 Sun]</span></span>)</li>
<li><a href="http://batsov.com/articles/2011/11/30/the-ultimate-collection-of-emacs-resources/">Batsov's Collection of Resources</a> (last updated on <span class="timestamp-wrapper"><span class="timestamp">[2011-11-30 Wed]</span></span>)</li>
</ul>
</div>
</div>

<div id="outline-container-org338a6d4" class="outline-3">
<h3 id="org338a6d4">Startup Files</h3>
<div class="outline-text-3" id="text-org338a6d4">
<p>
These links discuss emacs startup files.
There are many others I'm sure.
</p>

<ul class="org-ul">
<li><a href="http://doc.norang.ca/org-mode.html">Bernt Hansen</a> - "Org Mode - Organize Your Life In Plain Text!" is an excellent
resource on org-mode as well as many things emacs related.</li>
<li><a href="http://oremacs.com/2015/04/24/oremacs-config/">Oleh Krehel</a></li>
<li><a href="http://pages.sachachua.com/.emacs.d/Sacha.html">Sacha Chua</a></li>
<li><a href="https://github.com/grettke/home">grettke</a> (see ALEC.org)</li>
<li><a href="https://github.com/larstvei/dot-emacs">Lars Tveito</a></li>
<li>Ryan Rix: <a href="http://fort.kickass.systems:10082/cgit/fsem.git/tree/">org source</a>, <a href="http://doc.rix.si/org/fsem.html">html version</a>, <a href="http://rix.si/blog/2015/01/05/fsem-001/">2015/01/05 blog</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1c02baf" class="outline-3">
<h3 id="org1c02baf">Org Mode</h3>
<div class="outline-text-3" id="text-org1c02baf">
<p>
Some links on org mode:
</p>

<ul class="org-ul">
<li><a href="http://orgmode.org">org-mode home page</a></li>
<li><a href="http://orgmode.org/worg">worg</a></li>
<li><a href="http://www.emacswiki.org/emacs/OrgMode">OrgMode at emacswiki</a></li>
<li><a href="http://orgmode.org/worg/dev/">worg dev</a></li>
<li><a href="http://doc.norang.ca/org-mode.html">Bernt Hansen</a> - "Org Mode - Organize Your Life In Plain Text!"</li>
<li><a href="http://orgmode.org/worg/org-tutorials/">Tutorials at worg</a></li>
<li><a href="https://www.youtube.com/watch?v=1-dUkyn_fZA&amp;feature=youtube_gdata_player">Emacs + org-mode + python in reproducible research; SciPy 2013 Presentation</a></li>
<li><a href="http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html">Emacs org-mode examples and cookbook</a> - lots of neat ways to use org</li>
</ul>
</div>
</div>
</div>
