emacs.org
** Package Overview

For an overview see [[info:emacs#Packages][Packages]] section of Emacs manual, and [[info:elisp#Packaging][Packaging]] section of
Emacs-Lisp manual. Also you should be familiar with the following concepts
explained in [[Elisp Basics]] section to understand this section:
/loading/, /autoload/, =load-path=, /byte-compiling/, etc.

A package is a collection of files.  Most often the files are elisp files, but
it could also include info manuals and other files.  Installing a package
usually means

- Creating a new sub-directory under the directory specifiied by
  [[info:elisp#Packaging Basics][package-user-dir]] variable
- Unpacking files (usually from a tarball) to the new directory
- [[info:elisp#Byte Compilation][Byte-compiling]] all elisp files.
- Generating the /autoload file/, i.e., a file that contains [[info:emacs#Lisp Libraries][autoload]] forms.
- Generating info manuals from texinfo source files if any

Once installed, a package needs to be *activated* to make it available for use.
This includes three things
- add installed package directory to [[info:elisp#Library%20Search][load-path]]
- [[info:elisp#Loading][Load]] the autoload file, i.e., =<package>-autoloads.el= file found in the
  package install directory if any
- add package directory to [[info:info#Emacs Info Variables][info-directory-list]] if the package comes with GNU
  info manual

All installed packages are *activated* on emacs startup, i.e., emacs searches
all sub-directories of [[info:elisp#Packaging Basics][package-user-dir]] and activates them.

Following are few variables which control package installation as well activation:

- [[info:elisp#Package Archives][package-archives]] determines package sources, i.e., location from which to
  find packages
- [[info:elisp#Packaging%20Basics][package-user-dir]] determines where packages get installed
- [[info:elisp#Packaging%20Basics][package-load-list]] determines which
  packages are initialized on startup among all the installed
  package.  Default is to initialize all.

Following are some of the functions related with packaging:

- [[info:emacs#Package Menu][list-packages]] pops up "GUI" buffer so
  that you can browes, install, and delete packages interactively.
- [[info:elisp#Packaging%20Basics][package-initialize]] is implicitly called by default *after*
  evaluating =~/.emacs=.  However you can also call this explicitly
  in your =~/.emacs= early on to *activate* installed packages.

* Emacs-Lisp
