emacs.html

<div id="outline-container-orgcfc1ad8" class="outline-2">
<h2 id="package"><a id="orgcfc1ad8"></a>Package</h2>
<div class="outline-text-2" id="text-package">
</div>

<div id="outline-container-orge58b3" class="outline-3">
<h3 id="orge58b3">Package Overview</h3>
<div class="outline-text-3" id="text-orge58b3">
<p>
For an overview see <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Packages">Packages</a> section of Emacs manual, and <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Packaging">Packaging</a> section of
Emacs-Lisp manual. Also you should be familiar with the following concepts
explained in <a href="#elisp_basics">Elisp Basics</a> section to understand this section:
<i>loading</i>, <i>autoload</i>, <code>load-path</code>, <i>byte-compiling</i>, etc.
</p>

<p>
A package is a collection of files.  Most often the files are elisp files, but
it could also include info manuals and other files.  Installing a package
usually means
</p>

<ul class="org-ul">
<li>Creating a new sub-directory under the directory specifiied by
<a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Packaging-Basics">package-user-dir</a> variable</li>
<li>Unpacking files (usually from a tarball) to the new directory</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Byte-Compilation">Byte-compiling</a> all elisp files.</li>
<li>Generating the <i>autoload file</i>, i.e., a file that contains <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Lisp-Libraries">autoload</a> forms.</li>
<li>Generating info manuals from texinfo source files if any</li>
</ul>

<p>
Once installed, a package needs to be <b>activated</b> to make it available for use.
This includes three things
</p>
<ul class="org-ul">
<li>add installed package directory to <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Library-Search">load-path</a></li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Loading">Load</a> the autoload file, i.e., <code>&lt;package&gt;-autoloads.el</code> file found in the
package install directory if any</li>
<li>add package directory to <a href="http://www.gnu.org/software/emacs/manual/html_mono/info.html#Emacs-Info-Variables">info-directory-list</a> if the package comes with GNU
info manual</li>
</ul>

<p>
All installed packages are <b>activated</b> on emacs startup, i.e., emacs searches
all sub-directories of <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Packaging-Basics">package-user-dir</a> and activates them.
</p>

<p>
Following are few variables which control package installation as well activation:
</p>

<ul class="org-ul">
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Package-Archives">package-archives</a> determines package sources, i.e., location from which to
find packages</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Packaging-Basics">package-user-dir</a> determines where packages get installed</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Packaging-Basics">package-load-list</a> determines which
packages are initialized on startup among all the installed
package.  Default is to initialize all.</li>
</ul>

<p>
Following are some of the functions related with packaging:
</p>

<ul class="org-ul">
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Package-Menu">list-packages</a> pops up "GUI" buffer so
that you can browes, install, and delete packages interactively.</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Packaging-Basics">package-initialize</a> is implicitly called by default <b>after</b>
evaluating <code>~/.emacs</code>.  However you can also call this explicitly
in your <code>~/.emacs</code> early on to <b>activate</b> installed packages.</li>
</ul>
</div>
</div>
</div>
