emacs.org
** Elisp Basics
:PROPERTIES:
:CUSTOM_ID: elisp_basics
:END:
#+INDEX: elisp basics

This chapter points out a few basic emacs-lisp concepts to help
you understand how to install and use add-on packages.
More comprehensive resources on learning elisp are listed at
[[New User Resources]]

Topics covered include
- elisp files define functions, variables, and other objects
- emacs loads (i.e., evaluates) files to pick up new functions, and also
  possibly modify built-in features
- [[info:elisp#Library Search][load-path]] tells emacs where to find elisp files
- [[info:emacs#Lisp Libraries][autoload]] allows easy access to functions without using too much memory
- elisp files are byte-compiled mainly for faster execution

The core emacs code is written in C.  However much of built-in features of emacs
is written in emacs-lisp which is a lisp dialect customized for use within
emacs.  The core of emacs is the elisp *interpreter* (or a *virtual machine*).
When you use emacs you are interacting with the interpreter which is in
infinite *REPL*, i.e., [[info:elisp#Command Loop][Read-Eval-Print-Loop]].  It just sits there and waits for
you to use input devices such as keyboards and mice to request actions.

When you type anything on the keyboard or use mouse, you are executing elisp
function bound to the key or mouse event that you just invoked.  For example if
you type =m=, then you are asking the interpreter to call =self-insert-command=
elisp function which just inserts the letter just typed into the current buffer.
However =m= is bound to =dired-mark= elisp function instead of
=self-insert-command= within buffers in [[info:emacs#Dired][dired-mode]] so that typing =m= results
not in inserting letter =m=, but marking the current item in dired buffer.
See [[info:emacs#Keys][Keys]], [[info:emacs#Keys][Commands]].

You can use [[info:emacs#Key Help][C-h k]] to ask emacs to describe what any given key sequence would
do rather than calling the function bound to that key sequence.  For example
typing [[info:emacs#Key Help][C-h k]] followed by =m= in most buffers would say that the =m= key
sequence is bound to =self-insert-command=.  Similarly typing [[info:emacs#Key Help][C-h k]] followed
by =C-x C-f= brings up =*Help*= buffer describing [[info:emacs#Basic Files][find-file]] function.
=*Help*= buffer should show *files.el* link at the top.[fn:elfiles]
Clicking your mouse button on this *files.el* link
should bring up =files.el= file showing emacs-lisp code that
implements =find-file= function, i.e., you can browse the source code that make
up emacs.  This is one key reason why I almost always use my own build of emacs
rather than =/usr/bin/emacs= or other emacs builds provided someone else.

Emacs function are written via [[info:elisp#Defining Functions][defun]] (among other ways) like this
#+BEGIN_SRC elisp
(defun f (arg1 arg2 ...) ...)
#+END_SRC
The side effect of evaluation this expression is that the lisp interpreter
has added =f= function to its internal database of known functions.
Similarly variables are set via [[info:elisp#Global Variables][setq]], [[info:elisp#Applying Customizations][custom-set-variables]],
among other ways:
#+BEGIN_SRC elisp
(setq make-backup-files nil)
#+END_SRC
Evaluating this make the variable known to emacs.

Functions and variables are put in emacs-lisp files such as =files.el= mentioned
above.  Files are then [[info:elisp#Loading][loaded]] into emacs, i.e., the content of the file is
[[info:elisp#Evaluation][evaluated]] by the elisp interpreter whose side effect is to tuck away the
function and variable definitions so that they can be called or accessed.  In
most cases new emacs-lisp code is made known to the interpreter by loading elisp
files via one of these ways:

- [[info:elisp#Loading][load-file]] evaluates the specified file whose side effect is to define
  new functions and variables, and also possibly modify existing ones
- [[info:elisp#Library Search][load-library]] first searches the directories listed in =load-path= (much like
  how linux shells search =PATH=) for the specified file name, then calls
  =load-file= on the located file
- [[info:elisp#Named Features][require]] first search =features= variable to see if the requested module
  is already loaded or not.  If is is already loaded, then nothing is done.
  If it is not, then =load-library= is called.

However you can also [[info:elisp#Evaluation][evaluate]] specific elisp expressions within
buffers interactively via
=eval-last-sexp= (bound to =C-x C-e=),
=eval-print-last-sexp=,
=eval-region=,
=eval-current-buffer=,
=eval-expression=,
etc.

# Some [[info:elisp#Functions][functions]] are referred to as *commands*.
# These are a subset of all elisp functions which the user can call
# *interactively* via either key bindings or via
# [[info:elisp#Interactive Call][execute-extended-command]] wihch is bound to =M-x= key sequence.

[fn:elfiles] If you don't see a link to an elisp file within =*Help*= buffer, it
probably means that you don't have the elisp source files installed.  On Debian
derived GNU/Linux systems, you can fix this via something like
=sudo apt-get install emacs24-el=.

** Elisp Expressions
   :PROPERTIES:
   :CUSTOM_ID: expressions
   :END:
#+INDEX: expressions

Resources:

- Use the =*scratch*= buffer to experiment and learn.  Use =C-j= to
  call =eval-print-last-sexp=.
- [[info:emacs-lisp-intro#Top]]
- [[info:elisp#Eval]]
- [[info:elisp#Loading]]

Lisp expressions can be evaluated in many ways:

- =C-x C-e= bound to =eval-last-sexp= evaluates one expression at a
  time and prints the result in the mini-buffer
- =eval-print-last-sexp= evaluates one expression and prints the
  result in current buffer.  This is bound to =C-j= within buffers in
  =lisp-interaction-mode= mode such as =*scratch*= buffer.
- [[info:elisp#Eval][eval-region]] evaluates a region of elisp code
- [[info:elisp#Eval][eval-buffer]] evaluates the whole buffer
- [[info:elisp#How Programs Do Loading][load]] evaluates elisp code in a file
- [[info:elisp#How Programs Do Loading][load-library]] evaluates elisp
  code in a file but uses LOAD-PATH to locate the requested file
- [[info:elisp#Named Features][require]] looks up
  [[info:elisp#Named Features][features]] and if not found, then uses =load-libary= to
  locate and load the file

