emacs.html

<div id="outline-container-orgd103a2a" class="outline-2">
<h2 id="orgd103a2a">Emacs-Lisp</h2>
<div class="outline-text-2" id="text-orgd103a2a">
</div><div id="outline-container-org33e5eb9" class="outline-3">
<h3 id="elisp_basics"><a id="org33e5eb9"></a>Elisp Basics</h3>
<div class="outline-text-3" id="text-elisp_basics">
<p>
This chapter points out a few basic emacs-lisp concepts to help
you understand how to install and use add-on packages.
More comprehensive resources on learning elisp are listed at
<a href="#org1448624">New User Resources</a>
</p>

<p>
Topics covered include
</p>
<ul class="org-ul">
<li>elisp files define functions, variables, and other objects</li>
<li>emacs loads (i.e., evaluates) files to pick up new functions, and also
possibly modify built-in features</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Library-Search">load-path</a> tells emacs where to find elisp files</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Lisp-Libraries">autoload</a> allows easy access to functions without using too much memory</li>
<li>elisp files are byte-compiled mainly for faster execution</li>
</ul>

<p>
The core emacs code is written in C.  However much of built-in features of emacs
is written in emacs-lisp which is a lisp dialect customized for use within
emacs.  The core of emacs is the elisp <b>interpreter</b> (or a <b>virtual machine</b>).
When you use emacs you are interacting with the interpreter which is in
infinite <b>REPL</b>, i.e., <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Command-Loop">Read-Eval-Print-Loop</a>.  It just sits there and waits for
you to use input devices such as keyboards and mice to request actions.
</p>

<p>
When you type anything on the keyboard or use mouse, you are executing elisp
function bound to the key or mouse event that you just invoked.  For example if
you type <code>m</code>, then you are asking the interpreter to call <code>self-insert-command</code>
elisp function which just inserts the letter just typed into the current buffer.
However <code>m</code> is bound to <code>dired-mark</code> elisp function instead of
<code>self-insert-command</code> within buffers in <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Dired">dired-mode</a> so that typing <code>m</code> results
not in inserting letter <code>m</code>, but marking the current item in dired buffer.
See <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Keys">Keys</a>, <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Keys">Commands</a>.
</p>

<p>
You can use <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Key-Help">C-h k</a> to ask emacs to describe what any given key sequence would
do rather than calling the function bound to that key sequence.  For example
typing <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Key-Help">C-h k</a> followed by <code>m</code> in most buffers would say that the <code>m</code> key
sequence is bound to <code>self-insert-command</code>.  Similarly typing <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Key-Help">C-h k</a> followed
by <code>C-x C-f</code> brings up <code>*Help*</code> buffer describing <a href="http://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Basic-Files">find-file</a> function.
<code>*Help*</code> buffer should show <b>files.el</b> link at the top.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
Clicking your mouse button on this <b>files.el</b> link
should bring up <code>files.el</code> file showing emacs-lisp code that
implements <code>find-file</code> function, i.e., you can browse the source code that make
up emacs.  This is one key reason why I almost always use my own build of emacs
rather than <code>/usr/bin/emacs</code> or other emacs builds provided someone else.
</p>

<p>
Emacs function are written via <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Defining-Functions">defun</a> (among other ways) like this
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #3a81c3;">(</span><span style="color: #0000ff; font-weight: bold;">defun</span> <span style="color: #0000ff; font-weight: bold;">f</span> <span style="color: #6c3163;">(</span>arg1 arg2 ...<span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
The side effect of evaluation this expression is that the lisp interpreter
has added <code>f</code> function to its internal database of known functions.
Similarly variables are set via <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Global-Variables">setq</a>, <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Applying-Customizations">custom-set-variables</a>,
among other ways:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #3a81c3;">(</span><span style="color: #0000ff; font-weight: bold;">setq</span> make-backup-files nil<span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
Evaluating this make the variable known to emacs.
</p>

<p>
Functions and variables are put in emacs-lisp files such as <code>files.el</code> mentioned
above.  Files are then <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Loading">loaded</a> into emacs, i.e., the content of the file is
<a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Evaluation">evaluated</a> by the elisp interpreter whose side effect is to tuck away the
function and variable definitions so that they can be called or accessed.  In
most cases new emacs-lisp code is made known to the interpreter by loading elisp
files via one of these ways:
</p>

<ul class="org-ul">
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Loading">load-file</a> evaluates the specified file whose side effect is to define
new functions and variables, and also possibly modify existing ones</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Library-Search">load-library</a> first searches the directories listed in <code>load-path</code> (much like
how linux shells search <code>PATH</code>) for the specified file name, then calls
<code>load-file</code> on the located file</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Named-Features">require</a> first search <code>features</code> variable to see if the requested module
is already loaded or not.  If is is already loaded, then nothing is done.
If it is not, then <code>load-library</code> is called.</li>
</ul>

<p>
However you can also <a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Evaluation">evaluate</a> specific elisp expressions within
buffers interactively via
<code>eval-last-sexp</code> (bound to <code>C-x C-e</code>),
<code>eval-print-last-sexp</code>,
<code>eval-region</code>,
<code>eval-current-buffer</code>,
<code>eval-expression</code>,
etc.
</p>
</div>
</div>

<div id="outline-container-orgb04c20d" class="outline-3">
<h3 id="expressions"><a id="orgb04c20d"></a>Elisp Expressions</h3>
<div class="outline-text-3" id="text-expressions">
<p>
Resources:
</p>

<ul class="org-ul">
<li>Use the <code>*scratch*</code> buffer to experiment and learn.  Use <code>C-j</code> to
call <code>eval-print-last-sexp</code>.</li>
<li><a href="emacs-lisp-intro.html#Top">emacs-lisp-intro#Top</a></li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Eval">elisp#Eval</a></li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Loading">elisp#Loading</a></li>
</ul>

<p>
Lisp expressions can be evaluated in many ways:
</p>

<ul class="org-ul">
<li><code>C-x C-e</code> bound to <code>eval-last-sexp</code> evaluates one expression at a
time and prints the result in the mini-buffer</li>
<li><code>eval-print-last-sexp</code> evaluates one expression and prints the
result in current buffer.  This is bound to <code>C-j</code> within buffers in
<code>lisp-interaction-mode</code> mode such as <code>*scratch*</code> buffer.</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Eval">eval-region</a> evaluates a region of elisp code</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Eval">eval-buffer</a> evaluates the whole buffer</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#How-Programs-Do-Loading">load</a> evaluates elisp code in a file</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#How-Programs-Do-Loading">load-library</a> evaluates elisp
code in a file but uses LOAD-PATH to locate the requested file</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Named-Features">require</a> looks up
<a href="http://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Named-Features">features</a> and if not found, then uses <code>load-libary</code> to
locate and load the file</li>
</ul>
</div>
</div>
